<?php
return [

	// 通用请求
	200 => '请求成功',
	900 => '数据处理异常',
	9001 => '未获取到微信数据',
	9002 => '未获取到相关数据',
	9003 => '系统异常，请联系管理员',
	9004 => '编辑未能成功',
	9005 => '消息推送未能成功',
	// 用户相关返回值
	10000 => '请传递用户编号',

	// 云券相关返回值
	11000 => '该用户未绑定云券',
	11001 => '该小程序未开通云券功能',
	11002 => '请传递云券编号',
	11003 => '请传递设备编号',
	11004 => '未获取到相关店铺信息',
	11005 => '请传入云券用户编号',
	11006 => '请传入云券变更数量',
	11007 => '该用户未注册云券',
	11008 => '云券收入记账未能成功',
	11009 => '云券支出记账未能成功',
	11010 => '云券用户信息错误',

	// 其他
	20000 => '该城市不在服务区',
	20001 => '该市不在服务区',
	20002 => '该省不在服务区',

	// 教育类返回值
	30000 => '学员不存在',
	30001 => '请不要重复投票',
	30002 => '投票操作未能成功',
	30003 => '云券未能领取成功',
	30004 => '教练不存在',
	// 小程序获取access_token返回值
	40001 => 'AppSecret 错误或者 AppSecret 不属于这个小程序，请开发者确认 AppSecret 的正确性',
	40002 => '请确保 grant_type 字段值为 client_credential',
	40013 => '不合法的 AppID，请开发者检查 AppID 的正确性，避免异常字符，注意大小写',

	50001 => '可用提现金额不足',
	50002 => '提现申请未能提交成功',
	50003 => '提现金额过低',
	50004 => '提现金额超过上限',
];